using Microsoft.AspNetCore.Http;
using Microsoft.AspNetCore.Mvc;
using RecipeServer.Model;
using System.Security.Cryptography;

namespace RecipeServer.Controllers
{
    [Route("api/[controller]")]
    [ApiController]
    public class RecipeController : Controller
    {
        public static List<Recipe> recipes = new List<Recipe>
        {
          new Recipe { Id=2, Name="עוגת כדורי שוקולד עם מוס שוקולד וגבינה", CategoryId=1, PreparationTime= 120, Level=3,DateAdded= new DateTime(),
              Products=new List<string>{
                     "שוקולד פרה מריר (300 גרם)",
                     "חמאה (100 גרם)",
                     "חלב (1 כוס)",
                     "פתי בר עלית (500 גרם)",
                     "קקאו (4 כפות)",
                     "סוכר לבן (2/3 כוס)",
                     "מלח",
                     "שוקולד פרה מריר (350 גרם)",
                     "שמנת מתוקה להקצפה (2 מיכלים - 500 מ\"ל)",
                     "גבינת מסקרפונה (2 מיכלים - 500 גרם)",
                     "אבקת סוכר (3 כפות)",
                     "שוקולד פרה מריר (120 גרם)",
                     "שמנת מתוקה להקצפה (1/2)"},
              Instructions=new List<string>{   "טוחנים את הפתי בר לפירורים קטנים.",
                  "מרפדים את תבנית התנור בנייר אפייה בשוליים ובדפנות.",
                  "ממיסים בקערה בינונית את השוקולד המריר, החמאה והחלב. מצננים את התערובת עד שהיא מגיעה לטמפ' החדר.",
                  "בקערה גדולה מערבבים את פירורי הביסקוויטים, הקקאו, הסוכר והמלח. מוסיפים את בלילת השוקולד ומערבבים עד לקבלת בלילה אחידה.",
                  "מרפדים את תחתית ודפנות התבנית עם כמות של 2/3 מהבלילה ומעבירים לקירור למשך ארבעים דקות לפחות.",
                  "משאר הבלילה מכינים כדורי שוקולד ומצפים בסוכריות צבעוניות. מעבירים לקירור.",
                  "בקערה בינונית ממיסים את השוקולד המריר ו-1/2 כוס מהשמנת המתוקה. מצננים לטמפ' החדר.",
                  "בקערת מיקסר עם בלון הקצפה מקציפים במהירות נמוכה את שארית השמנת המתוקה, גבינת המסקרפונה ואבקת הסוכר עד שהגבינה נטמעת לחלוטין בשמנת. עוברים למהירות בינונית ומקציפים עד לקבל קרם רך ומעט יציב.",
                  "מקפלים כשליש מהקרם אל תערובת השוקולד, וכשהוא נטמע לחלוטין מוסיפים את שארית הקרם ומקפלים לאיחוד.",
                  "יוצקים את הקרם אל תוך קלתית כדורי השוקולד ומיישרים. מעבירים לקירור.",
                  "ממיסים את השוקולד המריר והשמנת המתוקה ומצננים לטמפ' החדר.",
                  "מוזגים את הגנאש על העוגה ומקררים.",
                  "לאחר שהגנאש מתייצב, מקשטים את העוגה עם כדורי השוקולד שהכנו." }, UserId=1,
              Image="https://www.regamatok-elite.co.il/wp-content/uploads/2020/06/%D7%A2%D7%95%D7%92%D7%AA-%D7%A9%D7%95%D7%A7%D7%95%D7%9C%D7%93-%D7%9B%D7%93%D7%95%D7%A8%D7%99.jpg"
          },
          new Recipe { Id=3, Name="טרייפל רבע לשבע", CategoryId=3, PreparationTime= 60, Level=1,DateAdded= new DateTime(),
              Products=new List<string>{ "4 מיכלי שמנת מתוקה להקצפה", "1 כפית תמצית וניל", "400 גרם שוקולד מריר עלית", "2 חבילות רבע לשבע עלית" },
              Instructions=new List<string>{  "ממיסים את השוקולד המריר עם מיכל וחצי של שמנת מתוקה. מעבירים חצי מכמות השוקולד המומס לקערה בינונית ומצננים מעט.",
                 "מקציפים את שאר השמנת (2.5 מיכלים) עם תמצית הוניל לקצפת יציבה. מעבירים מחצית מהקצפת לקערה הבינונית עם השוקולד המומס ומקפלים לקבלת קרם שוקולד אחיד. כעת יש לנו קערה עם רוטב שוקולד, קערה עם מוס שוקולד וקצפת.",
                 "מניחים בתחתיב הקערה שכבת מוס שוקולד, שכבת קצפת, ושכבת גנאש שוקולד.",
                 "חוצים לאורך חבילה אחת של אצבעות רבע לשבע ומצמידים אותם לדפנות קערת הטרייפל, כך שהמילוי יופנה כלפי חוץ. ממשיכים כך להרכיב את הטרייפל בשכבות.",
                 "משתמשים בחצאי הרבע לשבע שנותרו על מנת לקשט את הטרייפל מלמעלה. מעבירים לקירור למשך שעה לפחות ומגישים."
              }, UserId=1,
              Image="https://www.regamatok-elite.co.il/wp-content/uploads/2021/06/%D7%A8%D7%90%D7%A9%D7%99%D7%AA-2.jpg"
          },
          new Recipe { Id=4, Name="עוגת שוקולד שכבות עם כתר עוגיות שוקולד צ’יפס", CategoryId=1, PreparationTime= 120, Level=3,
              DateAdded= new DateTime(), Products=new List<string>{  "5 ביצים L",
                  "1 כוס סוכר",
                  "1 כוס קמח",
                  "1 שקית אבקת אפייה",
                  "5 כפות קקאו עלית"
              },
              Instructions=new List<string>{    "בקערה שמתאימה למיקרו שמים 300 גרם שוקולד ביחד עם מיכל (250 מ&#8221;ל) שמנת מתוקה וממיסים עד לקבלת רוטב שוקולד מבריק. מעבירים למקרר לשעתיים.",
                  "משמנים רינג בקוטר 22 ס&#8221;מ בתרסיס שמן ומצמידים לדפנות ולתחתית נייר אפייה.",
                  "מחממים תנור ל-165 מעלות.",
                  "מפרידים את הביצים לחלבונים וחלמונים ומקציפים רק את החלבונים עם הסוכר עד לקבלת קצף יציב.",
                  "מוסיפים את החלמונים ומקציפים עוד 2 דקות.",
                  "מנפים פנימה קמח, קקאו ואבקת אפייה ומקפלים עד לקבלת תערובת אחידה.",
                  "מוזגים את הבלילה לתבנית העוגה ואופים במשך 45 דקות או עד שהעוגה יציבה. אפשר גם לאפות את העוגה ב-2 תבניות בקוטר 22 ואז לא תצטרכו לחתוך אותה באמצע אחרי האפייה.",
                  "מקררים היטב את העוגה במקרר, מוציאים וחותכים לשכבות בעובי שרוצים. אפשר חתוך ל-2 שכבות או ל-3 או ל-4.",
                  "מוציאים את השוקולד והשמנת שהתקררו בינתיים במקרר ומעבירים לקערת מיקסר עם וו הקצפה.",
                  "מוסיפים את יתרת השמנת ומקציפים עד לקבלת מוס יציבה.",
                  "ועכשיו מרכיבים: מניחים שכבה ראשונה של טורט ומרטיבים אותו עם מייפל או ריבה שאוהבים.",
                  "מזלפים שכבה של מוס ומניחים מעל שכבת טורט. חוזרים על השכבות כשהשכבה העליונה היא שכבת הטורט.",
                  "לעיטור מעל: ממיסים ביחד שוקולד ושמנת עד לקבלת רוטב חלק. מצננים מעט.",
                  "מורחים את הגאנש על החלק העליון של העוגה וממתינים שיתייצב מעט.",
                  "מעטרים מסביב עוגיות שוקולד צ&#8217;יפס ומגישים."
              }, UserId=1,
              Image="https://www.regamatok-elite.co.il/wp-content/uploads/2022/01/%D7%A2%D7%95%D7%92%D7%AA-%D7%94%D7%9E%D7%9C%D7%9B%D7%94-%D7%A8%D7%90%D7%A9%D7%99%D7%AA.jpg" },
          new Recipe { Id=5, Name="רוגעלך בלונדי", CategoryId=2, PreparationTime= 60, Level=2,
              DateAdded= new DateTime(), Products=new List<string>{  "5 ביצים L",
                 "40 גרם אבקת סוכר",
                 "350 גרם קמח",
                 "100 גרם חמאה קרה",
                 "1 גביע שמנת חמוצה",
                 "קורט מלח",
                 "200 גרם בלונדי קרמל מלוח או שקדים",
                 "100 גרם שקדים טחונים",
                 "50 גרם חמאה",
                 "30 גרם אבקת סוכר",
                 "4 כפות גבינת ריקוטה / טוב טעם"
              },
              Instructions=new List<string>{       "במיקסר עם וו גיטרה או במעבד מזון עם להב פלדה (אפשר גם ידנית) מערבבים חמאה קרה, קמח ואבקת סוכר לתערובת פירורית.",
                 "מוסיפים שמנת חמוצה וקורט מלח ומערבבים לקבלת בצק אחיד.",
                 "עוטפים את הבצק בניילון נצמד ומעבירים למקרר לשעה.",
                 "מכינים את מלית הבלונדי - מניחים בקערה שוקולד בלונדי וחמאה וממיסים בפולסים במיקרוגל או על בן מארי לתערובת אחידה.",
                 "מוסיפים שקדים טחונים, אבקת סוכר וגבינה ומערבבים לקבלת מלית סמיכה.",
                 "מוציאים את הבצק מהמקרר ומחלקים ל-2. פותחים ליריעה מלבנית בעובי 1 ס״מ.",
                 "על הבצק מורחים חצי ממלית הבלונדי ומיישרים עם פלטה או סכין.",
                 "בעזרת גלגלת פיצה או סכין חדה ומחלקים את הבצק למשולשים.",
                 "נגלגל כל משולש לצורת רוגעלך - מהחלק הרחב של המשולש ועד הקצה שלו.",
                 "נעביר את עוגיות הרוגעלך במרווחים לתבנית מרופדת בנייר אפייה (מומלץ להניח כל רוגעלך שהסגירה של הבצק כלפי מטה שלא ייפתח באפייה).",
                 "אופים בתנור שחומם מראש ל-175 מעלות כ- 15-20 דקות. הרוגעלך מוכנים כשהם בהירים אך יציבים.",
                 "לאחר האפייה מצננים לחלוטין ובוזקים מעל אבקת סוכר."
              }, UserId=1,
              Image="https://www.regamatok-elite.co.il/wp-content/uploads/2023/06/3-1.jpg" },
          new Recipe { Id=6, Name="טריפל שוקולד של רחלי קרוט", CategoryId=3, PreparationTime= 30, Level=1,
              DateAdded= new DateTime(), Products=new List<string>{  "5 ביצים L",
                   "200 גרם שוקולד פרה מריר",
                   "100 גרם חמאה",
                   "2 ביצים L",
                   "3/4 כוס סוכר לבן",
                   "1/2 כוס קורנפלור",
                   "1 כפית אבקת אפייה",
                   "1/3 כוס קקאו 23% שומן",
                   "80 גרם שוקולד פרה חלב",
                   "80 גרם שוקולד פרה לבן"
              },
              Instructions=new List<string>{   "בקערה מתאימה למיקרוגל מניחים שוקולד קצוץ גס או שוברים לקוביות ומוסיפים את החמאה.",
                   "ממיסים במיקרו, בפולסים של 30 שניות, עד שנוצר רוטב שוקולד מבריק.",
                   "במיקסר עם וו הקצפה על מהירות גבוהה מקציפים את הביצים והסוכר עד לקבלת קצף יציב ובהיר. זה לוקח בערך 5 דקות.",
                   "כשהקצף מוכן מעבירים אותו לקערה עם השוקולד ומאחדים ביו התערובות בתנועות קיפול בעזרת לקקן כמעט עד שהתערובת אחידה בצבע שלה (המטרה היא לאחד בין התערובות ולא לטרוף חזק אחרת כל הקצף ירד).",
                   "בקערה קטנה מערבבים את הקורנפלור, אבקת אפייה והקקאו ביחד ומוסיפים לקערה.",
                   "מערבבים בעדינות עד שהקורנפלור והקקאו נטמעים. מקפידים לא לערבב יותר מדי רק עד שזה אחיד.",
                   "קוצצים גס את השוקולד, (אפשר להשתמש גם במטבעות) ומערבבים יחד ממש בעדינות.",
                   "מכסים את הקערה ומעבירים למקרר לשעה או עד יומיים.",
                   "מחממים תנור ל-180 מעלות.",
                   "על גבי תבנית תנור עם נייר אפייה, מניחים כף גדושה של תערובת השוקולד, מקפידים להשאיר רווחים בין העוגיות כי הן מתפשטות בתנור. אמורות להיכנס 9 עוגיות בתבנית תנור בכל פעם.",
                   "אופים בדיוק 12 דקות ולא שנייה אחת יותר. העוגיות מוכנות ברגע שהחלק העליון לא מבריק יותר אלא קצת סדוק. אם תחכו עוד דקה שתיים הן יהיו עוגיות טעימות אבל לא פאדג'יות.",
                   "מצננים את העוגיות כ-10 דקות לפני שמעבירים אותן מהתבנית."
              }, UserId=1,
              Image="https://www.regamatok-elite.co.il/wp-content/uploads/2023/03/KRT_2655.jpg" },
          new Recipe { Id=7, Name="טארט טראפלס שוקולד עם קרמל מלוח", CategoryId=1, PreparationTime= 240, Level=4,
              DateAdded= new DateTime(), Products=new List<string>{  "5 ביצים L",
                   "לקלתית:",
                   "1 כוס (140 גרם) קמח לבן",
                   "100 גרם חמאה קרה, חתוכה לקוביות",
                   "1 כף תמצית וניל איכותית",
                   "4 כפות אבקת סוכר",
                   "5-6 כפות מים או חלב",
                   "לשכבת הקרמל מלוח:",
                   "150 מיליליטר (מ\"ל) שמנת מתוקה להקצפה",
                   "3/4 כוס (150 גרם) סוכר לבן",
                   "3 כפות דבש או גלוקוז",
                   "20 גרם חמאה",
                   "קמצוץ מלח גס",
                   "למילוי הטראפלס שוקולד:",
                   "250 גרם שוקולד פרה מריר",
                   "1 מיכל (250 מיליליטר) שמנת מתוקה להקצפה",
                   "50 גרם חמאה",
                   "2 כפות מייפל",
                   "להגשה:",
                   "אספרסו כפול מקפסולה 100% גואטמלה 11 של קפה עלית"
              },
              Instructions=new List<string>{
                    "להכנת הקלתית:",
                    "בקערת מעבד המזון שמים קמח, חמאה, וניל וסוכר ומעבדים בפולסים עד שנוצרים פירורים. מוסיפים את המים וממשיכים לעבד בפולסים עד שנוצרים פירורים גדולים. אם צריך, מוסיפים עוד קצת מים.",
                    "מניילנים ומעבירים למקרר לחצי שעה.",
                    "מרדדים את הבצק לעובי 1/2 ס&#8221;מ ומניחים בתוך תבנית טארט מתפרקת. מקפידים שהבצק יגיע לתחתית ולדפנות כדי ליצור זוית של 90 מעלות בשוליים.",
                    "מעבירים את הבצק למקפיא לחצי שעה ובינתיים מחממים את תנור ל-180 מעלות.",
                    "מניחים בתוך הטארט הקפוא ניילון נצמד שמתאים לתנור או נייר אפייה מקומט וממלאים במשקולות (אורז, חומוס, קטניות או עדשים) עד לגובה הבצק.",
                    "אופים את הטארט במשך 20 דקות ולאחר מכן מוציאים את המשקולות עם הנייר או הניילון וממשיכים לאפות עוד 15 דקות או עד שהבצק בצבע זהוב עדין. מוציאים ומצננים מעט.",
                    "לקרמל מלוח:",
                    "בסיר בינוני שמים סוכר ודבש (או גלוקוז) וממיסים על אש נמוכה עד שהסוכר נמס לגמרי ומקבל צבע ענברי.",
                    "מוסיפים חמאה ומערבבים בעדינות.",
                    "מחממים את השמנת במיקרו או בסיר קטן ומוסיפים לקרמל בעדינות. מערבבים עד שנוצר רוטב חלק בצבע משגע. ממשיכים לבשל עד שהקרמל מסמיך ומגיע לצבע חום (חשוב להקפיד שלא ישרף). שימו לב שזה לוקח בערך 5-10 דקות ושחשוב להגיע למרקם של דבש סמיך. ממליחים.",
                    "שופכים את הקרמל על הקלתית האפויה.",
                    "לטראפלס שוקולד:",
                    "בקערה שמתאימה למיקרו שמים את השוקולד, השמנת, החמאה והמייפל וממיסים בפולסים של 30 שניות עד שנוצר רוטב מבריק.",
                    "שופכים את השוקולד על הקרמל עד שהוא מגיע לפני הבצק.",
                    "מעבירים את הטארט למקרר לשעתיים לפחות או עד להגשה.",
                    "מגישים לצד אספרסו כפול מקפסולה 100% גואטמלה 11 של קפה עלית" }, UserId=1,
              Image="https://www.regamatok-elite.co.il/wp-content/uploads/2020/08/%D7%98%D7%90%D7%A8%D7%98-%D7%98%D7%A8%D7%90%D7%A4%D7%9C%D7%A1-%D7%A9%D7%95%D7%A7%D7%95%D7%9C%D7%93-%D7%95%D7%A7%D7%A8%D7%9E%D7%9C-%D7%9E%D7%9C%D7%95%D7%97.jpg" },
          new Recipe { Id=8, Name="עוגת דבש חגיגית", CategoryId=1, PreparationTime= 90, Level=2,
              DateAdded= new DateTime(), Products=new List<string>{  "5 ביצים L",
                      "2 ביצים L או 3 M",
                      "1/2 כוס (120 גרם) סוכר חום כהה",
                      "1/3 כוס (70 גרם) שמן",
                      "1/2 כוס דבש איכותי",
                      "1/2 כוס (120 מ”ל) תה חזק חזק בכל טעם שאוהבים",
                      "1 כפית תמצית וניל איכותית",
                      "1 כוס + 2 כפות (170 גרם) קמח לבן",
                      "1 כפית (5 גרם) אבקת אפייה – ולא גרם יותר",
                      "1/4 כפית (2 גרם) אבקת סודה לשתייה – ולא גרם יותר",
                      "100 גרם שוקולד פרה בלונדי/ לבן",
                      "לקרם:",
                      "125 גרם (1/2 מיכל) גבינת מסקרפונה",
                      "250 מ\"ל (1 מיכל) שמנת מתוקה",
                      "1 כף אבקת סוכר",
                      "1/2 כפית תמצית וניל",
                      "לקישוט:",
                      "200 גרם שוקולד פרה לבן",
                      "1/2 רימון"
              },
              Instructions=new List<string>{
                        "מחממים תנור ל-165 מעלות ומשמנים היטב תבנית עגולה. מומלץ להניח גם נייר אפייה בתחתית ו/או בדפנות.",
                        "מכינים תה חזק: ממלאים 1/2 כוס במים רותחים ושמים בפנים תיון שאוהבים. מניחים לתה להתקרר בצד עד לשלב שבו צריך להוסיף את התה.",
                        "במיקסר עם וו הקצפה שמים ביצים וסוכר ומקציפים על מהירות גבוהה במשך 7 דקות או עד שהבלילה מסמיכה ויש בועות צפופות.",
                        "מוסיפים שמן, דבש, וניל ותה וממשיכים להקציף עוד 2 דקות ולא יותר.",
                        "מוסיפים קמח, אבקת אפייה וסודה לשתייה (אם תשימו יותר ממה שכתוב העוגה תגלוש לכם לכל עבר) וממשיכים להקציף עוד דקה רק עד שהקמח נטמע ולא יותר מזה. אם צריך מסיימים את הערבוב עם לקקן כדי לוודא שאין קמח בתחתית הקערה.",
                        "שוברים את השוקולד לקוביות ומוסיפים לתערובת.",
                        "מעבירים מיד לתבנית משומנת, מקפידים שהבלילה תגיע עד 2/3 גובה כי היא תופחת, ואופים בתנור שחומם מראש ל-165 מעלות במשך 45 דקות או עד שהעוגה זהובה וקיסם המוחדר למרכז האמצע יוצא עם פירורים לחים.",
                        "מכינים את הקרם: מכניסים לקערת מיקסר עם וו הקצפה את כל המצרכים ומקציפים עד לקבלת קרם יציב.",
                        "כאשר העוגה הצטננה לגמרי מורחים שכבה נדיבה של הקרם מעל העוגה ויורדים מעט גם לדפנות.",
                        "הכנת הקישוט:",
                        "מקלפים את הרימון ומפרידים את הגרגירים.",
                        "ממיסים בפולסים קצרים במיקרו את השוקולד הלבן.",
                        "מניחים נייר אפייה על מגש ישר או קרש חיתוך. יוצקים עליו את השוקולד ומיישרים לשכבה דקה.",
                        "מפזרים את גרגירי הרימון על השוקולד. מכניסים את השוקולד להתייצבות במקרר.",
                        "מוציאים את השוקולד מהמקרר לאחר שהתקשה. שוברים לשברים ומקשטים את העוגה."

              }, UserId=1,
              Image="https://www.regamatok-elite.co.il/wp-content/uploads/2021/08/%D7%A9%D7%9C%D7%91%D7%99%D7%9D-1.jpg" },
          new Recipe { Id=9, Name="עוגת קפה ושוקולד בציפוי שוקולד ואגוזי לוז ", CategoryId=1, PreparationTime= 60, Level=2,
              DateAdded= new DateTime(), Products=new List<string>{   "לעוגה:",
                    "2 ביצים L",
                    "1/2 כוס שמן",
                    "1 מיכל (250 מ״ל) שמנת מתוקה 38%",
                    "2/3 כוס סוכר",
                    "3 כפות קקאו",
                    "1 כף קפה נמס עלית",
                    "1 כוס קמח",
                    "1 כפית (1/2 שקית) אבקת אפייה",
                    "לציפוי:",
                    "100 גרם שוקולד מריר",
                    "80 מ״ל שמנת מתוקה",
                    "1/2 כוס אגוזי לוז"
              },
              Instructions=new List<string>{
                    "בקערה בינונית שמים ביצים, שמן, שמנת מתוקה וסוכר וטורפים היטב.",
                    "מוסיפים קמח ואבקת אפייה וטורפים רק עד שהקמח נטמע.",
                    "מחלקים את התערובת ל-2 קערות ומוסיפים לאחת קקאו ולשנייה קפה. מערבבים היטב.",
                    "מחממים תנור ל-170 מעלות.",
                    "משמנים היטב תבנית אינגליש קייק ומניחים בתוכה פס של נייר אפייה.",
                    "מוזגים פנימה את 2 הבלילות בצורה חופשית, קצת מכל אחת, עד ש-2 הבלילות נגמרות.",
                    "אופים במשך 35-45 דקות או עד שקיסם המוחדר למרכז העוגה יוצר עם פירורים לחים.",
                    "כשהעוגה יוצאת מהעוגה מעבירים אותה לרשת צינון.",
                    "בזמן שהעוגה מצטננת ממיסים ביחד שוקולד ושמנת ומערבבים היטב עד לקבלת רוטב חלק ומבריק.",
                    "קוצצים גס את האגוזים ומוסיפים לרוטב השוקולד.",
                    "שופכים את הרוטב על העוגה ומצננים. מגישים בטמפרטורת החדר."

              }, UserId=1,
              Image="https://www.regamatok-elite.co.il/wp-content/uploads/2023/02/%D7%A2%D7%95%D7%92%D7%AA-%D7%A7%D7%A4%D7%94-%D7%A9%D7%95%D7%A7%D7%95%D7%9C%D7%93-2-%D7%A8%D7%90%D7%A9%D7%99%D7%AA.jpg" },
             new Recipe { Id=10, Name="טירמיסו חלומי כמו באיטליה", CategoryId=3, PreparationTime= 30, Level=2,
              DateAdded= new DateTime(), Products=new List<string>{  "2 מכלים (500 מל) שמנת צמחית יטבתה",
                    "1 חבילה (80 גרם) אינסטנט פודינג וניל",
                    "1/3 כוס אבקת סוכר",
                    "1 כוס (240 מל) חלב סויה / שקדים",
                    "1 חבילה (200 גרם) ביסקוטים",
                    "1/2 כוס מים רותחים",
                    "2 כפות גדושות קפה נמס עלית",
                    "1 כף סוכר",
                    "1 כפית רום או ליקר קפה (לא חובה)",
                    "1/4 כוס קקאו עלית"
              },
              Instructions=new List<string>{
                    "מכינים את הקצפת: בקערת המיקסר מקציפים שמנת צמחית עם אינסטנט פודינג ואבקת סוכר עד לקבלת קצפת יציבה. מוסיפים את החלב תוך כדי הקצפה.",
                    "מכינים את הביסקוטים: מערבבים בקערה מים רותחים, קפה נמס, סוכר ורום עד לתערובת אחידה.",
                    "מרכיבים את הטרמיסו: מעבירים את הקצפת לשק זילוף ומזלפים מעט לתוך כוס. שוברים כל ביסקוטי לשניים. טובלים כל חצי ביסקוטי בתערובת הקפה ומניחים מעל הקצפת.",
                    "חוזרים על הפעולה: מזלפים מעל הביסקוטי קצפת נוספת ומעליה עוד ביסקוטי טבול בקפה. מסיימים בקצפת.",
                    "בעזרת מסננת מפדרים אבקת קקאו מעל הקצפת ומעבירים למקרר."

              }, UserId=1,
              Image="https://www.regamatok-elite.co.il/wp-content/uploads/2022/12/tiramiso_small.jpg" },
        };

        [HttpGet]
        public IEnumerable<Recipe> Get()
        {
            return recipes;
        }

        [HttpGet("{id}")]
        public Recipe Get(int id)
        {
            var recipe = recipes.Find((p) => p.Id == id);
            return recipe;
        }

        [HttpPost]
        public IEnumerable<Recipe> Post([FromBody] Recipe recipe)
        {
            recipes.Add(recipe);
            return recipes;
            throw new Exception("somthing worng");
        }

        [HttpPut("{id}")]
        public void Put(int id, [FromBody] Recipe recipe)
        {
            var rec = recipes.Find((p) => p.Id == id);

            rec.Name = recipe.Name;
            rec.CategoryId = recipe.CategoryId;
            rec.PreparationTime = recipe.PreparationTime;
            rec.Level = recipe.Level;
            rec.DateAdded = recipe.DateAdded;
            rec.Products = recipe.Products;
            rec.Instructions = recipe.Instructions;
            rec.Image = recipe.Image;

        }


        [HttpDelete("{id}")]
        public void Delete(int id)
        {
            var rec = recipes.Find((p) => p.Id == id);
            recipes.Remove(rec);
        }

    }
}
